
array = input().split(' ')
for v in array:
    print(v)

# Q
# 下記の問題をプログラミングしてみよう！
# 文字列 s_1, s_2 が半角スペースで区切られて 1 行で与えられます。
# 各文字列を出力するごとに改行し 2 行で出力してください。

# ▼　下記解答欄にコードを記入してみよう

# 入力される値
# 以下の形式で標準入力によって与えられます。
# 半角スペースで区切られた文字列 s_1, s_2 が 1 行で与えられます。


# s_1 s_2

# 入力値最終行の末尾に改行が１つ入ります。
# 文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# 入力された文字列 s_1, s_2 をそれぞれ改行区切りで出力してください。
# また、末尾に改行を入れ、余計な文字、空行を含んではいけません。


# s_1
# s_2
# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・s_1, s_2 は数字または大文字・小文字のアルファベットからなる長さ 1 以上 10 以下の文字列

# 入力例1
# hello paiza

# 出力例1
# hello
# paiza

# 入力例2
# 81 3

# 出力例2
# 81
# 3

# 入力例3
# hello 813

# 出力例3
# hello
# 813
