print(input())

# Q
# 下記の問題をプログラミングしてみよう！
# 半角スペースを含まない文字列 s が 1 行で与えられるので、そのまま出力してください。

# ▼　下記解答欄にコードを記入してみよう

# 入力される値
# 以下の形式で標準入力によって与えられます。
# 文字列 s が 1 行で与えられます。


# s

# 入力値最終行の末尾に改行が１つ入ります。
# 文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# 入力された文字列 s をそのまま出力してください。
# また、末尾に改行を入れ、余計な文字、空行を含んではいけません。


# s
# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・sは数字または大文字・小文字のアルファベットからなる長さ 1 以上 10 以下の文字列

# 入力例1
# hello

# 出力例1
# hello

# 入力例2
# 8132020

# 出力例2
# 8132020

# 入力例3
# paiza813

# 出力例3
# paiza813
