maxInt = int(input())

for v in range(maxInt):
    print(v + 1)

# Q
# 下記の問題をプログラミングしてみよう！
# 正の整数 N が与えられます。
# 1 ~ N の整数を 1 から順に改行区切りで出力してください。

# ▼　下記解答欄にコードを記入してみよう

# 入力される値
# N


# ・ 正の整数 N が 1 行で与えられます。

# 入力値最終行の末尾に改行が１つ入ります。
# 文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# 1 〜 N の整数を 1 から順に改行区切りで出力してください。
# 出力の末尾には改行を入れてください。


# 1
# 2
# ...
# N-1
# N
# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・ 1 ≦ N ≦ 100

# 入力例1
# 1

# 出力例1
# 1

# 入力例2
# 5

# 出力例2
# 1
# 2
# 3
# 4
# 5

# 入力例3
# 28

# 出力例3
# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8
# 9
# 10
# 11
# 12
# 13
# 14
# 15
# 16
# 17
# 18
# 19
# 20
# 21
# 22
# 23
# 24
# 25
# 26
# 27
# 28
